OpenFOAM-2.3.0/tutorials/compressible/rhoPorousSimpleFoam/angledDuctImplicit/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

m4 constant/polyMesh/blockMeshDict.m4 > constant/polyMesh/blockMeshDict

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication $application

# ----------------------------------------------------------------- end-of-file
